sample_levels = c('0709_P0',
                  '1009_P0',
                  '0726_P1',
                  '0815_P1',
                  '0828_P2',
                  '0606_P3',
                  '0903_P4',
                  '0819_P5',
                  '0731_P6',
                  '0821_P7',
                  '0425_P8',
                  '1017_P8',
                  '0823_P9',
                  '1018_P9',
                  '0905_P10',
                  '0906_P11',
                  '0806_P12',
                  '0722_P13',
                  '1022_P13',
                  '0617_P14')
time_color = c(
  '0709_P0' ='#313695',
  '1009_P0' ='#313695',
  '0726_P1' ='#4575B4',
  '0815_P1' ='#4575B4',
  '0828_P2' ='#619CC3',
  '0606_P3' ='#74ADD1',
  '0903_P4' ='#89C4DC',
  '0819_P5' ='#ABD9E9',
  '0731_P6' ='#D0EBF5',
  '0821_P7' ='#E0F3F8',
  '0425_P8' ='#FFFFBF',
  '1017_P8' ='#FFFFBF',
  '0823_P9' ='#FEE090',
  '1018_P9' ='#FEE090',
  '0905_P10'='#FDBB84',
  '0906_P11'='#FDAE61',
  '0806_P12'='#F46D43',
  '0722_P13'='#D73027',
  '1022_P13'='#D73027',
  '0617_P14'='#A50026')

time_color2 = c(
  'P0' ='#313695',
  'P1' ='#4575B4',
  'P2' ='#619CC3',
  'P3' ='#74ADD1',
  'P4' ='#89C4DC',
  'P5' ='#ABD9E9',
  'P6' ='#D0EBF5',
  'P7' ='#E0F3F8',
  'P8' ='#FFFFBF',
  'P9' ='#FEE090',
  'P10'='#FDBB84',
  'P11'='#FDAE61',
  'P12'='#F46D43',
  'P13'='#D73027',
  'P14'='#A50026')
time_levels = paste0('P', 0:14)

method_names = c(
  "tenX","tenXarc","sci-ATAC","sciMAP-ATAC", "snATAC","dscATAC","s3ATAC","txciATAC",   
  "sciATAC3","SPATAC","scifi", "HD-ATAC",
  "AS240726", "AS240606", "AS240806", "AS240823", "AS240815", "AS241017", "AS240903", "AS241018", "AS240905", "AS240722",
  "AS241009", "AS240617", "AS240425", "AS240828", "AS240819", "AS240821", "AS241022", "AS240906", "AS240731", "AS240709"
)
method_color = c(
  "#1C6E8C", # 深蓝绿色，暗淡且冷色调
  "#4A7B33", # 深橄榄绿，低饱和度
  "#A06723", # 深棕橙色，暗淡的暖色
  "#5C3B8C", # 深紫色，降低亮度
  "#357D74", # 暗青色，柔和冷色调
  "#8C7B00", # 深金色，较暗的暖色
  "#5A2A2A", # 深红棕色，避免和第一个颜色冲突
  "#3D7FF0", # 深青绿色，饱和度较低
  "#274B9F", # 深蓝色，低亮度
  "#7A3D5C", # 深粉色，柔和但有区分度
  "#505050",  # 深灰色，作为中性颜色
  "#FF0000", # 明亮的红色，作为最突出颜色
  "#FF0000","#FF0000","#FF0000","#FF0000","#FF0000","#FF0000","#FF0000","#FF0000","#FF0000","#FF0000",
  "#FF0000","#FF0000","#FF0000","#FF0000","#FF0000","#FF0000","#FF0000","#FF0000","#FF0000","#FF0000"
)
names(method_color) = method_names